{
  "transform_params" : {
    "data" : {
      "bias_a" : 0,
      "bias_g" : 0,
      "bias_r" : 0,
      "bias_b" : 0,
      "center_mean" : 0,
      "is_network_bgr" : 0,
      "scale" : 1
    }
  },
  "properties" : {

  },
  "storage" : "model.espresso.weights",
  "format_version" : 200,
  "layers" : [
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv1",
      "blob_weights" : 3,
      "K" : 3,
      "blob_biases" : 1,
      "stride_x" : 2,
      "name" : "conv1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 96,
      "bottom" : "data",
      "weights" : {

      },
      "Nx" : 7,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 7,
      "n_parallel" : 1
    },
    {
      "alpha" : 0.00050000002374872565,
      "bottom" : "conv1",
      "weights" : {

      },
      "local_size" : 5,
      "top" : "norm1",
      "type" : "lrn",
      "name" : "norm1",
      "beta" : 0.75
    },
    {
      "pad_value" : 0,
      "average_count_exclude_padding" : 0,
      "top_shape_style" : 2,
      "avg_or_max" : 1,
      "stride_x" : 3,
      "pad_mode" : 0,
      "stride_y" : 3,
      "pad_t" : 0,
      "weights" : {

      },
      "size_y" : 3,
      "type" : "pool",
      "pad_r" : 0,
      "pad_b" : 0,
      "size_x" : 3,
      "pad_fill_mode" : 0,
      "bottom" : "norm1",
      "pad_l" : 0,
      "name" : "pool1",
      "top" : "pool1"
    },
    {
      "pad_r" : 2,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 2,
      "pad_l" : 2,
      "top" : "conv2",
      "blob_weights" : 7,
      "K" : 96,
      "blob_biases" : 5,
      "name" : "conv2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 2,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "pool1",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 5,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1
    },
    {
      "pad_value" : 0,
      "average_count_exclude_padding" : 0,
      "top_shape_style" : 2,
      "avg_or_max" : 1,
      "stride_x" : 2,
      "pad_mode" : 0,
      "stride_y" : 2,
      "pad_t" : 0,
      "weights" : {

      },
      "size_y" : 2,
      "type" : "pool",
      "pad_r" : 0,
      "pad_b" : 0,
      "size_x" : 2,
      "pad_fill_mode" : 0,
      "bottom" : "conv2",
      "pad_l" : 0,
      "name" : "pool2",
      "top" : "pool2"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "conv3",
      "blob_weights" : 11,
      "K" : 256,
      "blob_biases" : 9,
      "name" : "conv3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "pool2",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "conv4",
      "blob_weights" : 15,
      "K" : 512,
      "blob_biases" : 13,
      "name" : "conv4",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "conv3",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "conv5",
      "blob_weights" : 19,
      "K" : 512,
      "blob_biases" : 17,
      "name" : "conv5",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "conv4",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_value" : 0,
      "average_count_exclude_padding" : 0,
      "top_shape_style" : 2,
      "avg_or_max" : 1,
      "stride_x" : 3,
      "pad_mode" : 0,
      "stride_y" : 3,
      "pad_t" : 0,
      "weights" : {

      },
      "size_y" : 3,
      "type" : "pool",
      "pad_r" : 0,
      "pad_b" : 0,
      "size_x" : 3,
      "pad_fill_mode" : 0,
      "bottom" : "conv5",
      "pad_l" : 0,
      "name" : "pool5",
      "top" : "pool5"
    },
    {
      "bottom" : "pool5",
      "weights" : {

      },
      "mode" : 0,
      "hint_fallback_from_metal" : 1,
      "top" : "pool5_15_flattened",
      "type" : "flatten",
      "name" : "fc6_preflatten"
    },
    {
      "nB" : 25088,
      "top" : "fc6",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 4048,
      "blob_weights" : 23,
      "type" : "inner_product",
      "has_relu" : 1,
      "bottom" : "pool5_15_flattened",
      "blob_biases" : 21,
      "has_tanh" : 0,
      "hint_fallback_from_metal" : 1,
      "name" : "fc6",
      "has_prelu" : 0
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "fc6_18_flattened",
      "type" : "flatten",
      "name" : "fc7_preflatten",
      "bottom" : "fc6"
    },
    {
      "nB" : 4048,
      "top" : "fc7",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 4048,
      "blob_weights" : 27,
      "type" : "inner_product",
      "has_relu" : 1,
      "bottom" : "fc6_18_flattened",
      "blob_biases" : 25,
      "has_tanh" : 0,
      "name" : "fc7",
      "has_prelu" : 0
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "fc7_21_flattened",
      "type" : "flatten",
      "name" : "fc8_cat_preflatten",
      "bottom" : "fc7"
    },
    {
      "nB" : 4048,
      "top" : "fc8",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 7,
      "blob_weights" : 31,
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "fc7_21_flattened",
      "blob_biases" : 29,
      "has_tanh" : 0,
      "name" : "fc8_cat",
      "has_prelu" : 0
    },
    {
      "C" : 2,
      "weights" : {

      },
      "top" : "prob",
      "type" : "softmax",
      "name" : "prob",
      "bottom" : "fc8"
    }
  ]
}